app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "name", "start_time", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 11 Mar 2014 07:14:10 UTC +00:00], ["name", "Goal2"], ["start_time", Wed, 05 Mar 2014 00:00:00 UTC +00:00], ["updated_at", Tue, 11 Mar 2014 07:14:10 UTC +00:00]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save