app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals"
---
  def index
    @goals = Goal.all

INSERT INTO "goals" ("created_at", "description", "frequency", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 11 Mar 2014 07:29:42 UTC +00:00], ["description", "555"], ["frequency", "Daily"], ["title", "test555"], ["updated_at", Tue, 11 Mar 2014 07:29:42 UTC +00:00], ["user_id", 1]]
---
  def create
    @goal = Goal.new(goal_params)

    respond_to do |format|
      if @goal.save

UPDATE "goals" SET "title" = $1, "description" = $2, "frequency" = $3, "updated_at" = $4 WHERE "goals"."id" = 501507362  [["title", "Eat a little healthier"], ["description", "Eat fast food no more than once a week"], ["frequency", "Daily"], ["updated_at", Mon, 10 Mar 2014 10:04:54 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @goal.update(goal_params)

DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 2]]
---
  def destroy
    @goal.destroy

SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", "501507362"]]
---
    def set_goal
      @goal = Goal.find(params[:id])