app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "/.mn,m.,mn.m,"], ["created_at", Thu, 01 May 2014 22:53:00 UTC +00:00], ["title", "njnln,.mn.,mn"], ["updated_at", Thu, 01 May 2014 22:53:00 UTC +00:00], ["user_id", 2]]