app/controllers/welcome_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [[nil, 1]]
---
  def index
    if user_signed_in?
      @goals = current_user.goals.all